[
  {
    "author": "Cassie Elish",
    "date": "November 4, 2020",
    "time": "9:45am",
    "title": "How I Was Introduced to the Daily Show",
    "content": [
      "You may be wondering: why have I decided to create an entire blog based on the history of The Daily Show? If so, you’ve come to the right place. I think it’s safe to say that I’ve enjoyed satire since I was a kid, but, for a long time, my primary satirical news source was the now-defunct Colbert Report, wherein Stephen Colbert played a conservative pundit to great effect. By comparison, the Daily Show always seemed a bit boring to me -- after all, Jon Stewart wasn’t even playing a character, and what was the fun in that?",
      "However, once I bought and read (and read and read and read) the oral history of the Daily Show, I started to appreciate just how much it changed television’s news landscape. Satire on cable television had always seemed a faraway, somewhat silly concept before Jon Stewart went and made it one of the most popular shows on Comedy Central. Looking at what the Daily Show covered produce an accurate rendition of what the left was feeling during certain events. The Daily Show should not be underestimated as a historical record."
    ],
    "subject": [
      "About Me",
      "Jon Stewart"
    ]
  },
  {
    "author": "Cassie Elish",
    "date": "November 4, 2020",
    "time": "5:45pm",
    "title": "The Daily Show before Jon Stewart",
    "content": [
      "Before Jon Stewart took over in 199, the show was hosted by Craig Kilborn. In that era, the show focused much more on 'easier' targets, joking about celebrities at their lowest points and people with eccentric hobbies. Even lacking the later edge that Stewart would bring to it, the show was a success -- TV Guide named it the best in late night comedy, and Kilborn was nominated for a number of hosting awards.",
      "However, Kilborn left unexpectedly in 1998, to take a position at The Late Late Show on CBS. As to be expected, there was a lot of uncertainty -- both within the network and within the show’s audience -- over who could replace him. In 1999, Jon Stewart -- a relatively unsuccessful comedian -- was hired, and the rest is history."
    ],
    "subject": [
      "Craig Kilborn",
      "Jon Stewart",
      "1998",
      "1999"
    ]
  },
  {
    "author": "Cassie Elish",
    "date": "November 4, 2020",
    "time": "6:20pm",
    "title": "The Daily Show as a Launching Pad",
    "content": [
      "Over the years, The Daily Show became a launching pad for aspiring comedians and satirists alike. Stephen Colbert worked for the show before Jon Stewart arrived, but a character he developed -- one of a conservative pundit, modeled after Bill O’Reilly -- on the show, as well as his general success as a correspondent under Jon Stewart, led him to his own network deal with The Colbert Report. Similarly, Samantha Bee, also a former correspondent, earned her show as a result of being a correspondent; Hasan Minhaj and John Oliver did, as well.",
      "Moreover, even if a comedian never worked for the Daily Show, the increase in satirical news shows over the last decade can surely be attributed to Stewart. The content of SNL’s “Weekend Update,” for example, has become slightly more cutting, and more traditional late night hosts like Seth Meyers have also started dabbling in satire-themed segments. In many ways, Stewart kickstarted the satire-filled television landscape we now have."
    ],
    "subject": [
      "Jon Stewart",
      "Stephen Colbert",
      "Samantha Bee",
      "John Oliver",
      "Hasan Minhaj",
      "Steve Carell",
      "Seth Meyers",
      "Weekend Update"
    ]
  }
]
